@extends('layouts.master')

@section('content')
<div class="container">
    <div class="row justify-content-center">
        <div class="col-md-8">
            <div class="container_12">
                <div class="grid_12">  
                    <p>По време на танцов конкурс, всеки съдия оценява изпълненията по три критерия, използвайки оценка от 1 до 10. Всеки танцьор има таблица с оценките, получени от всеки съдия. В регламента на състезанието  има условие да бъдат анулирани оценките  на съдия/съдии дал/и най-високи/най-ниски оценки за два или повече от критериите.</p>
                    <p>Пример. Съдия дава най-ниска оценка за музикалност и най-висока оценка за техника – и трите оценки на този съдия няма да участват в крайната оценка на танцьора. Сумата от оценките за всеки критерий се разделя  на броят им. За крайната оценка на танцьора се сумират крайните резултати по критерии.</p>
                    <p>Приложението, което разработвате съдържа административна, съдийска и потребителска част.</p>
                    <ul>Администраторът
                        <li>регистрира съдии и им дава данни за достъп.</li>
                        <li>добавя данни за състезателите и обработва крайните им резултати.</li>
                        <li>Отбелязва кои от състезателите се отказват от участие.</li> 
                    </ul>
                    <p>Само съдиите имат достъп  до страницата за въвеждане на оценки.</p>
                    <p>В потребителската част се вижда информация за състезанието, състезателите и публикуваните класирания.</p>
                    <p>Резултатите се обработват след като всички съдии са попълнили таблиците с оценките за всички явили се в състезанието състезатели. След обработка А публикува резултатите.</p>
                    <p>Резултатите се публикуват под формата на таблица с името на състезателя и неговия резултат, подредени по резултат в низходящ ред. В края на таблицата по азбучен ред /възходящо/ се изброяват отказалите се от участие състезатели.</p>
                    <p>Примери за обработване на резултати</p>
                    <p>За следните въведени резултати</p>
                    <table>
                        <tr>
                            <td>arbiter_id</td>
                            <td>first_criterion</td>
                            <td>second_criterion</td>
                            <td>third_criterion</td>
                        </tr>
                        <tr>
                            <td>1</td>
                            <td>3</td>
                            <td>10</td>
                            <td>10</td>
                        </tr>
                        <tr>
                            <td>2</td>
                            <td>2</td>
                            <td>3</td>
                            <td>4</td>
                        </tr>
                        <tr>
                            <td>3</td>
                            <td>5</td>
                            <td>6</td>
                            <td>7</td>
                        </tr>
                        <tr>
                            <td>4</td>
                            <td>2</td>
                            <td>5</td>
                            <td>9</td>
                        </tr>
                        <tr>
                            <td>5</td>
                            <td>2</td>
                            <td>2</td>
                            <td>2</td>
                        </tr>
                        </table>
                        <p>след анулиране на оценките на съдия, дал най-ниски и/или най-високи оценки за два или повече критерия, таблицата с резултатите на състезателя, ще изглежда така</p>
                    <table>
                        <tr>
                            <td>arbiter_id</td>
                            <td>first_criterion</td>
                            <td>second_criterion</td>
                            <td>third_criterion</td>
                        </tr>                            
                        <tr>
                               <td>2</td>
                            <td>2</td>
                            <td>3</td>
                            <td>4</td>
                        </tr>
                        <tr>
                            <td>3</td>
                            <td>5</td>
                            <td>6</td>
                            <td>7</td>
                        </tr>
                        <tr>
                            <td>4</td>
                            <td>2</td>
                            <td>5</td>
                            <td>9</td>
                        </tr>
                    </table>
                    <p>Първият съдия е дал най-висока оценка за два от критериите. Петият е дал и за трите критерия най-ниски оценки. Оценките и на двамата съдии не са включени във финалния резултат на състезателя.</p>
                    <p>Всеки съдия вижда таблица със списък от състезатели - имената му и коя държава представляват. В тази таблица попълва оценки за представянето му.</p>
                    <p>Администраторът вижда списък с имената на състезателите и коя държава представлява. За всеки състезател има линк към негова таблица с резултатите, попълнени от всички съдии. Всяка такава таблица трябва да бъде обработена /поотделно или всички заедно, вие преценете/ от администратора. След обработката, администраторът публикува резултатите на състезателите. </p>
                    <p>Потребителите виждат сумарно резултата на състезателя.</p>
                    <p>Администратора вижда детайлната таблица за всеки състезател, в която са премахнати /задраскани - вие изберете подходящия формат на представяне на обработената таблица с резултати.</p>
                </div>
            </div>
        </div>
    </div>
</div>
@endsection
